tap "databricks/tap"
tap "nikitabobko/tap"
tap "oktadeveloper/tap"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Simple command-line tool to read AWS CloudWatch logs
brew "awslogs"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Interface bandwidth monitor
brew "bmon"
# New way to see and navigate directory trees
brew "broot"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Command-line csv viewer
brew "csvlens"
# Top-like interface for container metrics
brew "ctop"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Converts boring normal dates to fun Discordian Date
brew "ddate"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Ping, but with a graph
brew "gping"
# Make JSON greppable
brew "gron"
# Tool for glamorous shell scripts
brew "gum"
# Command-line hex viewer
brew "hexyl"
# Idempotent command-line utility for managing your /etc/hosts file
brew "hostess"
# Improved top (interactive process viewer)
brew "htop"
# Run and Test HTTP Requests with plain text and curl
brew "hurl"
# Command-line benchmarking tool
brew "hyperfine"
# Command-line pager for JSON data
brew "jless"
# Lightweight and flexible command-line JSON processor
brew "jq"
# JSON query language CLI tool
brew "jql"
# Handy way to save and run project-specific commands
brew "just"
# Save disk space by cleaning non-essential files from software projects
brew "kondo"
# Kubernetes controller and tool for one-way encrypted Secrets
brew "kubeseal"
# Next-gen compiler infrastructure
brew "llvm"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# System information fetcher, with an emphasis on performance and minimalism
brew "macchina"
# Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "miller"
# Small, simple certificate authority
brew "minica"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Nice to use pager for humans
brew "moar"
# Mock HTTP server and proxy
brew "mockserver"
# Powerful paging program
brew "most"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Command-line Git information tool
brew "onefetch"
# Shell command parallelization utility
brew "parallel"
# Modern Python package and dependency manager supporting the latest PEP standards
brew "pdm"
# Draw UML diagrams
brew "plantuml"
# Modern replacement for ps written in Rust
brew "procs"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# QR Code generation
brew "qrencode"
# Fast, efficient and secure backup program
brew "restic"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Suite of Sparse Matrix Software
brew "suite-sparse"
# Log file highlighter
brew "tailspin"
# Text interface for Git repositories
brew "tig"
# Program that allows you to count code, quickly
brew "tokei"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Internet file retriever
brew "wget"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Additional completion definitions for zsh
brew "zsh-completions"
# Command-line interface for the Databricks platform
brew "databricks/tap/databricks"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# Web browser focusing on privacy
cask "brave-browser"
# App to build and share containerised applications and microservices
cask "docker"
cask "font-noto-color-emoji"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Tools to protect your emails and files
cask "gpg-suite"
# System monitoring app
cask "istat-menus"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Discover, download, and run local LLMs
cask "lm-studio"
# File system integration
cask "macfuse"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Open source build of Lens Kubernetes IDE
cask "openlens"
# Command-line shell and scripting language
cask "powershell"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Text editor for code, markup and prose
cask "sublime-text"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
