tap "aws/tap"
tap "cantino/mcfly"
tap "ellie/atuin"
tap "eth-p/software"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "manojkarthick/pqrs"
tap "stripe/stripe-cli"
tap "turbot/tap"
tap "wez/wezterm"
# Improved shell history for zsh and bash
brew "atuin"
# Automatic configure script builder
brew "autoconf@2.69"
# AWS Cloud Development Kit - framework for defining AWS infra as code
brew "aws-cdk"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Official Amazon AWS command-line interface
brew "awscli"
# Light UNIX download accelerator
brew "axel"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Interface bandwidth monitor
brew "bmon"
# GNU compiler collection
brew "gcc"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# GNU File, Shell, and Text utilities
brew "coreutils"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# GNU Emacs text editor
brew "emacs", link: false
# Emacs dependency management
brew "cask"
# Like cat but displays content with syntax highlighting
brew "ccat"
# Cross-platform make
brew "cmake"
# Utility that creates projects from templates
brew "cookiecutter"
# SQL-like query language for csv
brew "csvq"
# Top-like interface for container metrics
brew "ctop"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Converts boring normal dates to fun Discordian Date
brew "ddate"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Command-line DNS client
brew "dog"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# Fast, simple fuzzy text selector with an advanced scoring algorithm
brew "fzy"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Make JSON greppable
brew "gron"
# Tool for glamorous shell scripts
brew "gum"
# Command-line hex viewer
brew "hexyl"
# Idempotent command-line utility for managing your /etc/hosts file
brew "hostess"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# JSON query language CLI tool
brew "jql"
# Easy building and installing of Erlang/OTP instances
brew "kerl"
# Save disk space by cleaning non-essential files from software projects
brew "kondo"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Package manager for the Lua programming language
brew "luarocks"
# System information fetcher, with an emphasis on performance and minimalism
brew "macchina"
# Fly through your shell history
brew "mcfly"
# Powerful paging program
brew "most"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# Port scanning utility for large networks
brew "nmap"
# Git repository summary on your terminal
brew "onefetch"
# Extract just secret information out of OpenPGP secret keys
brew "paperkey"
# Simplistic interactive filtering tool
brew "peco"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Paste PNG into files
brew "pngpaste"
# Python package management tool
brew "poetry"
# Modern replacement for ps written by Rust
brew "procs"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# QR Code generation
brew "qrencode"
# Provides fake name and address data
brew "rig"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Autoformat shell script source code
brew "shfmt"
# Fuzzy Finder in rust!
brew "sk"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Executes SQL across text files
brew "textql"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Converts a ttyrec file into gif files
brew "ttygif"
# Internet file retriever
brew "wget"
# Homebrew, but with Docker images
brew "whalebrew"
# Fast CSV toolkit written in Rust
brew "xsv"
# Suite of barcodes-reading tools
brew "zbar"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Apache Parquet command-line tools and utilities
brew "manojkarthick/pqrs/pqrs"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Steampipe exposes APIs and services as a high-performance relational database, giving you the ability to write SQL-based queries to explore, assess and report on dynamic data.
brew "turbot/tap/steampipe"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# Securely stores and accesses AWS credentials in a development environment
cask "aws-vault"
# Web browser focusing on privacy
cask "brave-browser"
# App to build and share containerized applications and microservices
cask "docker"
# Text editor
cask "emacs"
# Web browser
cask "firefox"
cask "font-awesome-terminal-fonts"
cask "font-blex-mono-nerd-font"
# Monospaced font that includes programming ligatures
cask "font-cascadia-code"
# Icon set and toolkit
cask "font-fontawesome"
# Developer targeted fonts with a high number of glyphs
cask "font-iosevka-nerd-font"
cask "font-noto-color-emoji"
# Monospaced font with cursive italics and programming symbol ligatures
cask "font-victor-mono"
cask "font-victor-mono-nerd-font"
# Tools to protect your emails and files
cask "gpg-suite"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Neovim Client
cask "neovide"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# GUI client for PostgreSQL databases
cask "postico"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Team communication and collaboration software
cask "slack"
# Text editor for code, markup and prose
cask "sublime-text"
# Open-source code editor
cask "visual-studio-code"
# A GPU-accelerated cross-platform terminal emulator and multiplexer written by @wez and implemented in Rust
cask "wezterm-nightly"
# Video communication and virtual meeting platform
cask "zoom"
