ohmyzsh/ohmyzsh
ohmyzsh/ohmyzsh path:plugins/fzf
ohmyzsh/ohmyzsh path:plugins/asdf
ohmyzsh/ohmyzsh path:plugins/gradle
ohmyzsh/ohmyzsh path:plugins/emoji
ohmyzsh/ohmyzsh path:plugins/extract


unixorn/fzf-zsh-plugin
#Aloxaf/fzf-tab
#xpando/fzf-z

zsh-users/zsh-completions
zsh-users/zsh-syntax-highlighting
#zsh-users/zsh-history-substring-search
#spwhitt/nix-zsh-completions


